rayleighBenard2DTestCase_mo/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          46;
        startFace       4140;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          46;
        startFace       4186;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          92;
        startFace       4232;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4232;
        startFace       4324;
    }
)

// ************************************************************************* //
