rayleighBenard2DTestCase_mo/constant/flowProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Reference temperature
TRef            313.15;

// Reference temperature
deltaTRef       15;

// Reference density
rhoRef		1.1272;

// Reference freefall velocity (beta*deltaT*g*H)^0.5 
URef		0.062392;	

// Reference Rayleigh
RaRef		2.4e4;

// Reference Pr 
PrRef		0.712;	
// ************************************************************************* //
